{
  "08619175-711e-4fb8-8c73-9c298eed8a46.jpeg": {
    "id": 1,
    "path": "Kwang Yang SREF Tests\\08619175-711e-4fb8-8c73-9c298eed8a46.jpeg",
    "description": [
      "Futuristic multi-level building with rounded, cantilevered decks shown in a clean architectural line drawing; monochrome black ink on white with minimal surroundings; time of day not indicated; mood exploratory and technical; even, non-directional lighting implied; smooth, streamlined textures suggested by sparse hatching; three-quarter elevated perspective.",
      "The main subject is a sleek, pod-like structure with large overhangs and a cutaway revealing interior platforms; background is sparsely sketched terrain and pathways; colors limited to black and white; style: concept art/architectural sketch; medium: pen or digital ink; composition: strong perspective lines lead from base to upper level; lighting not specifically depicted; textures read as smooth panels and ribbed interiors.",
      "An elevated perspective shows a contemporary building perched on a central support with stair-like side volumes; the scene is rendered in fine linework without tonal shading; the mood is analytical and design-focused; time of day is undetermined; surfaces appear sleek with occasional ribbing; background details kept minimal.",
      "Cutaway architecture concept of a two- to three-story structure with rounded corners, window bands, and an open platform; surroundings are nearly empty except for hints of vegetation and street outlines; monochrome palette; medium looks like technical ink sketch; composition emphasizes cantilever and negative space; lighting evenly neutral; texture smooth with linear striations.",
      "A speculative building hovers over a base column, with a projecting terrace and wraparound glazing; the background is mostly blank with a few contour lines and shrubs; colors are grayscale lines only; mood is futuristic and clean; style is industrial design sketch; medium: line drawing; composition: bird’s-eye three-quarter view; lighting not defined; textures inferred through crosshatching.",
      "Architectural concept drawing featuring a streamlined, capsule-like upper volume and transparent mid-level; street grid and landscape are lightly indicated; no color beyond black line on white; time of day unspecified; ambiance calm and clinical; lighting appears diffuse; materials implied as smooth panels.",
      "Perspective sketch of a modern structure with an extended platform and ribbed interior walls; the environment is scarcely illustrated, keeping focus on the building; monochrome rendering; style minimalist technical illustration; medium ink or digital pen; composition stacked volumes with deep cantilevers; texture alternates between smooth shells and lined interiors.",
      "Design-centric illustration of a futuristic house or facility, drawn with precise contour lines and minimal shading; background: sparse ground plane and foliage marks; color: black-and-white; mood: conceptual and prototyping; time of day indeterminate; composition centered, high-angle view revealing interior; lighting neutral; textures sleek with fine linear detailing."
    ]
  },
  "25aaa2c3-e41e-4753-a1b3-c8e449398560.jpeg": {
    "id": 1,
    "path": "Kwang Yang SREF Tests\\25aaa2c3-e41e-4753-a1b3-c8e449398560.jpeg",
    "description": [
      "Architectural concept sketch of a multi-level modern building made of stacked rectangular volumes, drawn with blue linework and light blue shading on a white background; aerial oblique view with a calm, analytical mood and facades rendered with fine hatching and dotting.",
      "A modular complex with cantilevered blocks, broad terraces, and a central outdoor stair and seating area; sparse trees and a thin ground grid suggest a plaza; the style reads as an architectural line sketch with light wash tones.",
      "Limited blue-and-white palette with abundant negative space keeps focus on the interlocking forms; composition emphasizes long horizontal slabs and layered roofs; varied line weights add texture and depth.",
      "Background remains minimal with only faint outlines of surrounding masses, underscoring the structure as the main subject; lighting is implied by flat shadow planes beneath overhangs and to the lower left.",
      "High, slightly tilted viewpoint reveals bridges, setbacks, and sheltered areas beneath the volumes; the mood is conceptual and technical, resembling a schematic study; time of day is not indicated.",
      "Fine parallel hatching and stippling convey surface texture, while crisp edges define geometry; shading provides depth without full rendering.",
      "Open ground level with slender supports creates shaded semi-outdoor zones; loosely sketched trees add scale and soften the rigid forms; overall style is minimalist architectural illustration.",
      "Diagonal composition sweeping from lower left to upper right leads the eye across stepping platforms and terraces; light blue cast shadows articulate circulation paths.",
      "Pavement and planters are suggested through simple tonal blocks and line grids; surrounding buildings are hinted with pale contours rather than detailed depiction.",
      "A clean, monochrome architectural drawing focused on massing, proportion, and spatial sequencing rather than material realism; lighting cues are present, but the time of day remains indeterminate."
    ]
  },
  "3de8d58abd8c415cbc9418c1c672056a.jpeg": {
    "id": 1,
    "path": "Kwang Yang SREF Tests\\3de8d58abd8c415cbc9418c1c672056a.jpeg",
    "description": [
      "A tall abstract sculpture with bulbous, intertwined forms and a mirror-like metallic surface stands centered in the frame.",
      "The background is a neutral studio setup with a smooth gray gradient and a flat surface that holds a soft shadow beneath the piece.",
      "The colors are monochrome: chrome-silver tones with bright white highlights and deep gray reflections.",
      "The mood is sleek and contemplative, created by the reflective finish and the minimal setting.",
      "The time of day is not discernible; the scene appears to be photographed under controlled indoor conditions.",
      "The style is contemporary abstract minimalism with biomorphic curves presented like a gallery object.",
      "The medium appears to be a solid sculpture with a highly reflective, mirror-finished metal or metal-like surface.",
      "The composition centers the sculpture with ample negative space, a vertical emphasis, and a grounding shadow at the base.",
      "Lighting is soft and directional studio lighting, producing strong specular highlights and gentle falloff across the form.",
      "The texture is ultra-smooth and glossy, showing crisp reflections and no visible roughness."
    ]
  },
  "588de0ac-4f94-49b6-8f1d-9e9480c23207 2.jpeg": {
    "id": 1,
    "path": "Kwang Yang SREF Tests\\588de0ac-4f94-49b6-8f1d-9e9480c23207 2.jpeg",
    "description": [
      "Main subject: A conceptual sketch of a modern two-story building with a rounded, cantilevered upper volume and visible interior spaces.",
      "Background: Lightly indicated urban context with sparse lines and blocky forms, kept minimal to emphasize the structure.",
      "Colors: Limited palette of pale blues, grays, and dark linework, giving a cool, restrained look.",
      "Mood: Clean, calm, and technical, focusing on clarity of design and function.",
      "Time of day: Not specified in the image.",
      "Style: Architectural concept illustration with loose, precise drafting lines and a three-quarter aerial perspective.",
      "Medium: Line drawing with light wash tones; sketch-like rendering rather than photorealistic imagery.",
      "Composition: Elevated viewpoint showing exterior massing, a staircase, terraces, and small human figures for scale.",
      "Lighting: Even, diffuse lighting with minimal shading and subtle ground shadows beneath figures and elements.",
      "Texture: Smooth building surfaces contrasted with sketchy, layered linework and gentle wash textures."
    ]
  },
  "dbf0dbb9-38c1-4855-b900-851abec5af2c.jpeg": {
    "id": 1,
    "path": "Kwang Yang SREF Tests\\dbf0dbb9-38c1-4855-b900-851abec5af2c.jpeg",
    "description": [
      "A side-profile illustration of a robotic apparatus with a cylindrical body and one visible articulated leg, set against a plain white background; the palette is mainly white and gray with orange accents, giving a clean, technical mood; time of day is not indicated; the style is an industrial concept sketch with precise linework; composition is centered with generous negative space; lighting appears flat; surfaces look smooth with sketchy texture lines.",
      "Mechanical concept art showing a compact machine torso with exposed joints, cables, and structural arms, isolated on a minimal white field; colors are restrained—cool grays and off-white with selective yellow-orange panels; the mood feels utilitarian and futuristic; time of day is not shown; the medium appears as a line-based illustration; composition emphasizes a clear profile; lighting is even with light shading; textures mix smooth panels and rough sketch marks.",
      "An engineered mech-like device is depicted in a clean profile view, occupying the center against an empty background; desaturated grays dominate with sharp orange highlights; the mood is clinical and design-focused; no time context is given; the picture’s style reads as technical drawing/concept art; composition relies on negative space; lighting is neutral; textures suggest metal surfaces emphasized by crisp ink-like lines.",
      "A sleek, white-and-gray machine with orange detailing and visible pistons stands alone on a blank backdrop; the scene feels precise and contemplative; time of day cannot be determined; the rendering is a stylized technical sketch; the composition is balanced and minimal; lighting is soft and uniform; textures alternate between smooth body panels and sketch-textured edges.",
      "Profile view of a structured robotic module with one prominent limb and tubular components, presented on a stark white canvas; the color scheme is monochrome with warm accent tones; mood is analytical; time of day is unspecified; style: industrial design illustration; composition centers the subject with ample breathing room; lighting is understated; surfaces read as matte metal with fine line textures.",
      "An isolated mechanical walker-like unit is drawn with clean contour lines and selective color fills, floating in a near-empty space; whites and grays dominate, punctuated by orange; the mood suggests prototyping; time of day is undetermined; the medium is an illustrative concept sketch; composition is side-on and centered; lighting is flat; textures combine smooth plating with sketch hatch marks.",
      "Technical illustration of a compact mech body with cables and hinges exposed, set against a pure white background; restrained grayscale with orange notes sets a modern tone; mood is methodical; time is not indicated; style: concept art/line drawing; composition uses strong profile geometry; lighting is even with minimal shadows; texture appears smooth with crisp drawn edges.",
      "A futuristic machine torso with a single visible support limb is rendered in a minimalist scene; neutral grays and whites with orange panels dominate; the atmosphere feels precise and industrial; no time-of-day clues; the style is schematic and sketch-driven; composition centers the subject with large negative space; lighting lacks strong direction; textures are clean metal suggested by fine linework.",
      "Concept sketch of an engineered device featuring cylindrical housing and mechanical joints, isolated on white; cool tones accented by orange create a controlled, technical mood; time context is absent; medium is illustrative with line emphasis; composition is balanced in a right-facing profile; lighting is subdued and uniform; textures read as smooth surfaces with sparse shading.",
      "A detailed side-view drawing of a robotic assembly with exposed mechanisms stands alone against a blank background; primarily gray-white coloring with orange highlights; the mood is focused and industrial; time of day cannot be determined; the picture’s style is a clean design sketch; composition centers the subject with negative space; lighting is neutral; textures combine sleek panels and sketch-line roughness."
    ]
  }
}